#1.
# for i in range(1,5):#[1,2,3,4]
#     for i in range(i):  #寫出此行讓他變成1
#                                       # 12
#                                       # 123
#                                       # 1234
#         #變數
#         print(i,end="")
#                 #不想要斷行
#     print()
# print("程式執行完畢")

# 解:
n=5
for i in range(1,n):
    for a in range(1,i+1):
        print(a,end="")
    print()
# print("程式執行完畢")


"""
2.用for迴圈印出
123456789
12345678
1234567
123456
12345
1234
123
12
1
"""


#3.由使用者輸入數值,請透過for將1~數值做加總,最後印出總合
#使用者如果輸入10,就開始從1+2+3+4+5+6+7+8+9+10印出總合


#解:
j = 0
for i in range(1,10,1):
    j += i
    print(i)
print("總和:",j)






"""
4.挑戰題:
            *
           ***
          *****
         *******
          *****
           ***
            *
"""









